{
  "crewmate": {
    "Detective": "The Detective is a Crewmate that can examine the chalk outlines of the recently dead.\\\nOnce examined the Detective can then inspect players to find the victims killer. \\\nKillers flash red, but the innocent flash green.\\\nIn the following meeting, The Detective will receive a report on any dead body or chalk outline they examined.",
    "Investigator": "The Investigator is a Crewmate that can see the footprints of players.\\\nEvery footprint disappears after a set amount of time.\\\nThe Investigator can view the security cameras from anywhere on the map.",
    "Mystic": "The Mystic is a Crewmate that gets an alert revealing when someone has died.\\\nOn top of this, the Mystic briefly gets an arrow pointing in the direction of the body.\\\nThey Mystic can also see what other players are doing from their POV with the Mind Vision ability.",
    "Priest": "The Priest is a Crewmate that can reveal the alliance of other players.\\\nBased on settings, the Priest can find out whether a role is Good or Evil.\\\nA player's name will change color to their team.\\\nThe Priest also has the Sancitfy ability which creates an area where no interacting can occur.",
    "Snitch": "The Snitch is a Crewmate that can get arrows pointing towards the Impostors, once all their tasks are finished.\\\nThe names of the Impostors will also show up as red on their screen.\\\nBased on game settings, the Snitch may not know who they are until they have one task left.\\\nHowever, when they only have a single task left, the Impostors get an arrow pointing towards the Snitch.",
    "Spy": "The Spy is a Crewmate that can reveal information from players by planting bugs on them.\\\nInformation such as interacts, revives, sucessful and failed attacks, retaliations and status effects.\\\nThe Spy can also gain more information when on the Admin Table and can open the Admin Table from anywhere on the map.\\\nOn the Admin Table, the Spy can see the colors of every person on the map.\\\nThe Spy can also vent.",
    "Trapper": "The Trapper is a Crewmate that can place traps around the map.\\\nWhen players enter a trap they trigger the trap.\\\nIn the following meeting, all players who triggered a trap will have their role displayed to the trapper.\\\nHowever, this is done so in a random order, not stating who entered the trap, nor what role a specific player is.\\\nThe Trapper can also place traps on vents which roots the player who triggered it in place and alerts the Trapper.",
    "Sheriff": "The Sheriff is a Crewmate that has the ability to eliminate the Impostors using their kill button.\\\nHowever, if they kill a Crewmate or a Neutral player they can't kill, they instead die themselves.\\\nDuring meetings, the Sheriff can choose to kill someone by guessing their role, however, if they guess incorrectly, they die instead.",
    "Deputy": "The Deputy has the ability to handcuff a player.\\\nHandcuffs will be hidden until the handcuffed player try to use a disabled button/hotkey.\\\nHandcuffs disable:\n- Kill\n- Abilities\n- Vent\n- Report\\\n\\\n**NOTE:**\n- Duration starts after the handcuffs become visible.\n- Deputy can not be in game without Sheriff.",
    "Veteran": "The Veteran is a Crewmate that can go on alert.\\\nWhen the Veteran is on alert, anyone, whether crew, neutral or impostor, if they interact with the Veteran, they die.\\\nThe veteran can also vent and if attacked while in a vent the perpetrator is killed instead.",
    "Vigilante": "The Vigilante is a Crewmate that has only one shot available to them.\\\nThey can also track other players by tracking them during a round.\\\nOnce they track someone, an arrow is continuously pointing to them, which updates in set intervals.\\\nIf the Vigilante is voted off they actually survive and spawn in a random vent with an extra shot.",
    "Altruist": "The Altruist is a Crewmate that is capable of reviving dead players.\\\nUpon finding a dead body, the Altruist can hit their revive button, risking sacrificing themselves for the revival of another player.\\\nIf enabled, the dead body disappears, so only they Altruist's body remains at the scene.\\\nAfter a set period of time, the player will be resurrected, if the revival isn't interrupted.\nIf there is a Altruist in the game, there can't be a Vulture, Janitor or Necromancer.",
    "Medic": "The Medic is a Crewmate that can give any player a shield that will make them immortal until the Medic dies.\\\nA Shielded player cannot be Shifted into, Hacked or Killed by anyone, unless by suicide.\\\nThe Medic can view vitals from anywhere on the map.\\\nIf the Medic reports a dead body, they can get a report containing clues to the Killer's identity.\\\nA report can contain the name of the killer or the color type (Darker/Lighter)",
    "Engineer": "The Engineer is a Crewmate that can fix sabotages from anywhere on the map.\\\nThey can use vents to get across the map easily, and can seal them up too so noone else can enter or exit them.",
    "Mayor": "The Mayor is a Crewmate that can vote multiple times.\\\nThe Mayor has a Vote Bank, which is the number of times they can vote.\\\nThey have the option to abstain their vote during a meeting, adding that vote to the Vote Bank.\\\nAs long as not everyone has voted, the Mayor can use as many votes from their Vote Bank as they please.\\\nRegardless of if everyone has voted or not the Mayor can dump all their votes on a target in one click.",
    "Medium": "The Medium is a Crewmate that can see ghosts.\\\nDuring each round the Medium has an ability called Mediate.\\\nIf the Medium uses this ability and no one is dead, nothing will happen.\\\nHowever, if someone is dead, the Medium and the dead player will be able to see each other and communicate from beyond the grave!\\\nAfter a meeting the Medium can view the souls of the dead and can ask them for more information.\\\nIn the following meeting, the Medium will receive a report on any soul they questioned.",
    "Time Lord": "The Time Lord is a Crewmate that can rewind time and reverse the positions of all players.\\\nIf enabled, any players killed during this time will be revived.\\\nNothing but movements and kills are affected.\\\nThe Time Lord also has a Time Shield that they can use to protect themselves and the attacker will get rewinded by themselves.\\\nIf enabled, the Time Lord can't use Vitals to make things more balanced.",
    "Transporter": "The Transporter is a Crewmate that can change the locations of two random players at will.\\\nPlayers who have been transported are alerted with a blue flash on their screen.",
    "Bodyguard": "The bodyguard is a Crewmate that can protect another player from being killed and taking their place as the victim,\\\nwith an option to also kill the attacker.",
    "Imitator": "The Imitator is a Crewmate that can mimic dead crewamtes.\\\nDuring meetings the Imitator can select who they are going to imitate the following round from the dead.\\\nThey can choose to use each dead players as many times as they wish.\n\\\n**NOTE:**\n- The Imitator can't become the Mayor or the Snitch",
    "Tank": "The Tank is a crewmate role with the ability to taunt other players.\\\nIf a taunted player tries to attack the Tank, the attack fails.\\\nWhen this happens the Tank then gets the ability to counter attack and kill their attacker.\\\nPlayers taunted only reset if the Tank uses their Taunt ability again.\\\n\\\n**NOTE:**\n- Taunt it lasts through meetings",
    "Oracle": "The Oracle is a Crewmate that can get another player to provide insight information to them.\\\nThe Oracle has 3 abilities, the first is that when they die, the person who gave insight to them will reveal their alignment.\\\nThe second, is that every meeting the Oracle receives insight about who might be evil.\\\nThe final ability is giving a blessing to the person who gave them insight and gain vote immunity!",
    "Haunter": "The Haunter is a dead Crewmate that can reveal Impostors if they finish all their tasks.\\\nUpon finishing all of their tasks, Impostors are revealed to alive crewmates after a meeting is called.\\\nHowever, if the Haunter is clicked they lose their ability to reveal Impostors and are once again a normal ghost."
  },
  "impostor": {
    "Grenadier": "The Grenadier is an Impostor that can throw smoke grenades.\\\nDuring the game, the Grenadier has the option to throw down a smoke grenade which blinds crewmates so they can't see.",
    "Morphling": "The Morphling is an Impostor that can Morph into another player.\\\nAt the beginning of the game and after every meeting, they can choose someone to Sample.\\\nThey can then Morph into that person at any time for a limited amount of time.",
    "Swooper": "The Swooper is an Impostor that can temporarily turn invisible.",
    "Poisoner": "The Poisoner is an Impostor who has to poison another play instead of kill.\\\nWhen they poison a player, the poisoned player dies either upon the start of the next meeting or after a set duration.",
    "Traitor": "If all Impostors die before a certain point in the game, a random crewmate is selected to become the Traitor.\\\nThe Traitor has no additional abilities and their job is simply to avenge the dead Impostors.\\\nOnce this player has turned into the Traitor their alliance sits with the Impostors.",
    "Blackmailer": "The Blackmailer is an Impostor that can silence people in meetings.\\\nDuring each round, the Blackmailer can go up to someone and blackmail them.\\\nThis prevents the blackmailed person from speaking during the next meeting.",
    "Janitor": "The Janitor is an Impostor that can clean up bodies.\\\nBoth their Kill and Clean ability by default have a shared cooldown, meaning they have to choose which one they want to use.\nIf there is a Janitor in the game, there can't be a Vulture, Altruist or Necromancer.",
    "Miner": "The Miner is an Impostor that can create new vents.\\\nThese vents only connect to each other, forming a new passway.",
    "Undertaker": "The Undertaker is an Impostor that can drag and drop bodies.",
    "Camouflager": "The Camouflager is an Impostor that can turn everyone into colorless characters.\\\nEveryone then goes grey for a certain period of time, along with their names disappearing, making them become unrecognizable.",
    "Bounty Hunter": "The Bounty Hunter is an Impostor, that continuously get bounties (the targeted player doesn't get notified).\\\nThe target of the Bounty Hunter swaps after every meeting and after a configurable amount of time.\\\nIf the Bounty Hunter kills their target, their kill cooldown will be a lot less than usual.\\\nKilling a player that's not their current target results in an increased kill cooldown.\\\nDepending on the options, there'll be an arrow pointing towards the current target.\\\n\\\n**NOTE:**\n- The target won't be an Impostor, a Spy or the Bounty Hunter's Lover.\n- Killing the target resets the timer and a new target will be selected.",
    "Warlock": "The Warlock is an Impostor, that can curse another player (the cursed player doesn't get notified).\\\nIf the cursed person stands next to another player, the Warlock is able to kill that player (no matter how far away they are).\\\nPerforming a kill with the help of a cursed player, will lift the curse and it will result in the Warlock being unable to move for a configurable amount of time.\\\nThe Warlock can still perform normal kills, but the two buttons share the same cooldown.\\\n\\\n**NOTE:**\n- The Warlock can always kill their Impostor mates (and even themself) using the \"cursed kill\"\n- If there is a Warlock in the game, there can't be a Vampire\n- Performing a normal kill, doesn't lift the curse",
    "Witch": "The Witch is an Impostor who has the ability to cast a spell on other players.\\\nDuring the next meeting, the spellbound player will be highlighted and they'll die right after the meeting.\\\nThere are multiple options listed down below with which you can configure to fit your taste.\\\nSimilar to the Vampire, shields and blanks will be checked twice (at the end of casting the spell on the player and at the end of the meeting, when the spell will be activated).\\\nThis can result in players being marked as spelled during the meeting, but not dying in the end (when they get a shield or the Witch gets blanked after they were spelled by the Witch).\\\nIf the Witch dies before the meeting starts or if the Witch is being guessed during the meeting, the spellbound players will be highlighted but they'll survive in any case.\\\nDepending on the options you can choose whether voting the Witch out will save all the spellbound players or not.\\\n\\\n**NOTE:**\n- The spellbound players will die before the voted player dies (which might trigger e.g. trigger an Impostor win condition, even if the Witch is the one being voted)",
    "Ninja": "The Ninja is an Impostor who has the ability to kill another player all over the map.\\\nYou can mark a player with your ability and by using the ability again, you jump to the position of the marked player and kill it.\\\nDepending on the options you know where your marked player is.\\\nIf the Ninja uses its ability, it will leave a trace (leaves) for a configurable amount of time where it activated the ability and additionally where it killed the before marked player.\\\nWhen performing a ninja ability kill, the ninja can be invisible for some seconds (depends on options)\\\n\\\n**NOTE:**\n- The Ninja has a 5 second cooldown after marking a player\n- The trace has a darker (black) or lighter (white) color depending on the players color that will fade into green\n- The mark on the marked player will reset after a meeting or after using the ability to kill the marked player. Performing a normal kill will **NOT** reset the mark\n- If the Ninja tries to kill a shielded player (e.g. Medic shield, Shield last game first kill ), the kill will not be performed\n- If the Ninja tries to kill the Time Master while the shield is active, the Ninja won't teleport to the players position, but the Time Master shield will still be activated\n- If the marked target is on a different floor on Submerged, the arrow will always point to the elevator",
    "Astral": "The Astral is an Impostor who can leave their physical form and kill as a ghost,\\\nhowever if they do not kill within a certain time frame, they will stay dead.",
    "Necromancer": "The Necromancer is an Impostor who can raise dead players and make them a Ghoul.\\\nIf there is a Necromancer in the game, there can't be a Vulture, Altruist or Janitor.",
    "Scorpion": "The Scorpion is an Impostor who can mark a player for teleportation and teleport that player to them.",
    "Outlaw": "The Outlaw is an Impostor who can kill twice in a row within a certain time frame.",
    "Banshee": "The Banshee is an Impostor ghost role that can scare the living and root them in place.",
    "Sniper": "The Sniper is an Impostor role that can kill players from a distance.",
    "Possessor": "The Possessor is an Impostor role that can take control of players and kill them.",
    "Vampire": "The Vampire is an Impostor role that can only kill when lights are off.\\\nTo assist in the killing the Vampire has a seperate lights out ability.\\\nDuring lights out the Vampire speeds up, turns black and their name becomes red and shows as \"VAMPIRE\""
  },
  "neutral": {
    "Amnesiac": "The Amnesiac is a Neutral role with no win condition.\\\nThey have zero tasks and are essentially roleless.\\\nHowever, they can remember a role by finding a dead player.\\\nOnce they remember their role, they go on to try win with their new win condition.\\\nIf the Amnesiac doesn't remember a role once the minimum amount of crew are alive they will turn into the Shifter",
    "Guardian Angel": "The Guardian Angel is a Neutral role which aligns with the faction of their target.\\\nTheir job is to protect their target at all costs.\\\nIf their target loses, they lose.",
    "Survivor": "The Survivor is a Neutral role which can wins by simply surviving.\\\nHowever, if Lovers, or a Neutral Evil role wins the game, the survivor loses.\\\nIn order to achieve this goal, the Survivor has two abilities:\\\nThe \"Vest\" ability, which protects the Survivor and resets the kill cooldown of the attacker.\\\nThe \"Blank\" ability, where they can fill a killers (this also includes the Sheriff) weapon with a blank. So, if the killer attempts to kill someone, the killer will miss their target, and their cooldowns will be triggered as usual.\\\nIf the killer fires the \"Blank\", shields (e.g. Medic shield or Time Master shield) will not be triggered.\\",
    "Jester": "The Jester is a Neutral role with its own win condition.\\\nIf they are voted out after a meeting, the game finishes and they win.\\\nHowever, the Jester does not win if the Crewmates, Impostors or another Neutral role wins.",
    "Executioner": "The Executioner is a Neutral role with its own win condition.\\\nTheir goal is to vote out a player, specified in the beginning of a game.\\\nIf that player gets voted out, they win the game.",
    "Phantom": "The Phantom is a Neutral role with its own win condition.\\\nThey become half-invisible when they die and have to complete all their tasks without getting caught.",
    "Arsonist": "The Arsonist is a Neutral role with its own win condition.\\\nThey have two abilities, one is to douse other players with gasoline.\\\nThe other is to ingite all doused players.\\\nWhen all players have been ignited the Arsonist wins.",
    "Glitch": "The Glitch is a Neutral role with its own win condition.\\\nThe Glitch's aim is to kill everyone and be the last person standing.\\\nThe Glitch can Hack players, resulting in them being unable to report bodies and do tasks.\\\nHacking prevents the hacked player from doing anything but walk around the map.\\\nThe Glitch can Mimic someone, which results in them looking exactly like the other person.",
    "Juggernaut": "The Juggernaut is a Neutral role with its own win condition.\\\nThe Juggernaut's aim is to kill everyone and be the last person standing.\\",
    "Werewolf": "The Werewolf is a Neutral role with its own win condition.\\\nAlthough the Werwolf has a kill button, they can't use it unless they are Rampaged.\\\nOnce the Werewolf rampages they gain Impostor vision and the ability to kill.\\\nHowever, unlike most killers their kill cooldown is really short.\\\nThe Werewolf needs to be the last killer alive to win the game.",
    "Lawyer": "The Lawyer is a neutral role that has a client.\\\nThe client might be an Impostor or Neutral Killer which is not a Lover.\\\nDepending on the options, the client can also be a Jester.\\\nThe Lawyer needs their client to win in order to win the game.\\\nTheir client doesn't know that it is their client.\\\nIf their client gets voted out, the Lawyer dies with the client.\\\nIf their client dies, the Lawyer changes their role and becomes a different role (based on settings), which has a different goal to win the game.\\\nDuring a meeting the Lawyer can use their protection ability on players to prevent them from being assassinate.\\\n\\\nHow the Lawyer wins:\n- Lawyer dead/alive, client alive and client wins: The Lawyer wins together with the team of the client.\n- If their client is Jester and the Jester gets voted out, the Lawyer wins together with the Jester.\n**NOTE:**\n- If the client disconnects, the Lawyer will also turn into a different role depending on settings\n- The Lawyer needs to figure out the role of their client depending on the options",
    "Vulture": "The Vulture is a neutral role that must eat a specified number of corpses (depending on the options) in order to win.\\\nDepending on the options, when a player dies, the Vulture gets an arrow pointing to the corpse.\\\nIf there is a Vulture in the game, there can't be a Altruist, Janitor or Necromancer.",
    "Shifter": "The shifter is a Neutral role that can steal another players role.\\\nIf they try to steal an Impostor role however they will be killed.",
    "Jackal": "The Jackal is part of an extra team, that tries to eliminate all the other players.\\\nThe Jackal has no tasks and can kill Impostors, Crewmates and Neutrals.\\\nThe Jackal (if allowed by the options) can select another player to be their Sidekick.\nCreating a Sidekick removes all tasks of the Sidekick and adds them to the team Jackal. The Sidekick loses their current role (except if they're a Lover, then they play in two teams).\nThe \"Create Sidekick Action\" may only be used once per Jackal or once per game (depending on the options).\nThe Jackal can also promote Impostors to be their Sidekick, but depending on the options the Impostor will either really turn into the Sidekick and leave the team Impostors or they will just look like the Sidekick to the Jackal and remain as they were.\\\nAlso if a Spy or Impostor gets sidekicked, they still will appear red to the Impostors.\nThe team Jackal enables multiple new outcomes of the game, listing some examples here:\n- The Impostors could be eliminated and then the crew plays against the team Jackal.\n- The Crew could be eliminated, then the Team Jackal fight against the Impostors (The Crew can still make a task win in this scenario)\nThe priority of the win conditions is the following:\n1. Crewmate Mini lose by vote\n2. Jester wins by vote\n3. Arsonist win\n4. Team Impostor wins by sabotage\n5. Team Crew wins by tasks (also possible if the whole Crew is dead)\n6. Lovers among the last three players win\n7. Team Jackal wins by outnumbering (When the team Jackal contains an equal or greater amount of players than the Crew and there are 0 Impostors left and team Jackal contains no Lover)\n8. Team Impostor wins by outnumbering (When the team Impostors contains an equal or greater amount of players than the Crew and there are 0 players of the team Jackal left and team Impostors contains no Lover)\n9. Team Crew wins by outnumbering (When there is no player of the team Jackal and the team Impostors left)\n**NOTE:**\n- The Jackal (and their Sidekick) may be killed by a Sheriff.\n- A Jackal cannot target the Mini, while it's growing up. After that they can kill it or select it as its Sidekick.\n- The Crew can still win, even if all of their members are dead, if they finish their tasks fast enough (That's why converting the last Crewmate with tasks left into a Sidekick results in a task win for the crew.)\nIf both Impostors and Jackals are in the game, the game continues even if all Crewmates are dead. Crewmates may still win in this case by completing their tasks. Jackal and Impostor have to kill each other.",
    "Sidekick": "Gets assigned to a player during the game by the \"Create Sidekick\" ability of the Jackal and joins the Jackal in their quest to eliminate all other players.\\\nUpon the death of the Jackal (depending on the options), they might get promoted to Jackal themself and potentially even assign a Sidekick of their own.\\\n\\\n**NOTE:**\n- A player that converts into a Sidekick loses their previous role and tasks (if they had one).\n- The Sidekick may be killed by a Sheriff.\n- The Sidekick cannot target the Mini, while it's growing up.",
    "Bomber": "The Bomber is a Neutral role that can plant bombs on other players.\\\nand get them to kill for them or they die themselves when the timer ends.",
    "Joker": "The Joker is an Neutral role that can place decoys of other crewmates.\\\nTo win the Joker must get a number of those decoys killed to win.",
    "Poltergeist": "The Poltergeist is an Neutral role with its own win condition.\\\nThey become half-invisible when they die and have to get enough fake bodies reported without getting caught.\\\nFake dead bodies can be cleared by the crew by standing next to them for 5 seconds.",
    "Doomsayer": "The Doomsayer is an Neutral role with its own win condition.\\\nDuring meetings the Doomsayer has the ability to guess a crewmates role and assasinate them.\\\nTo win the Doomsayer must correctly guess the required number of roles.",
    "Pelican": "The Pelican is an Neutral role with its own win condition.\\\nThey can swallow players whole, but they do not die until a meeting is called. \\\nIf the Pelican is killed before a meeting is called, any players currently swallowed are released.",
    "Plaguebearer": "The Plaguebearer is a Neutral role with its own win condition, as well as an ability to transform into another role.\\\nThe Plaguebearer has one ability, which allows them to infect other players.\\\nOnce infected, the infected player can go and infect other players via interacting with them.\\\nOnce all players are infected, the Plaguebearer becomes Pestilence.\\\nThe Pestilence is an unkillable force which can only be killed by being voted out, even their lover dying won't kill them.\\\nThe Plaguebearer or Pestilence needs to be the last killer alive to win the game.",
    "Baker": "The Baker is a Neutral role with its own win condition, as well as an ability to transform into another role.\\\nThe Baker has the ability to give Bread to other players.\\\nWhen enough players have been given Bread, the Baker becomes Famine.\\\nIf less than 3 players are alive and they have not yet transformed, the Baker will die of starvation.\\\nAll players without Bread will die of starvation the round after Famine transforms.\\\nIf they are killed before then, the starvation will not occur.\\\nPlayers with Bread survive for 3 more rounds before starving and will be alerted that the Famine has begun. \\\nThe Famine has the ability to speed up a players starvation by one round.\\\nThe Famine is an unkillable force which can only be killed by being voted out, even their lover dying won't kill them.\\\nThe Famine needs to be the last killer alive to win the game.",
    "Berserker": "The Berserker is a Neutral role with its own win condition, as well as an ability to transform into another role.\\\nThe Beserker has the ability to kill.\\\nAfter the first kill the Berserker's kill cooldown is halved.\\\nAfter the second kill the Berserker gains the Berserk ability which causes any player who interacts with them to die.\\\nWhen 3 players have been killed, the Berserker becomes War.\\\nWar is an unkillable force which can only be killed by being voted out, even their lover dying won't kill them.\\\nWar has the ability to kill 2 players in a single attack if their victims are close together.\\\nThe Berserker or War needs to be the last killer alive to win the game.",
    "Reaper": "The Reaper is a Neutral role with its own win condition, as well as an ability to transform into another role.\\\nThe Reaper has one ability, which allows them to collect the souls of players when they die.\\\nThe souls can be collected either directly from dead bodies or automatically when a marked target is killed.\\\nOnce enough souls are collected, the Reaper becomes Death.\\\nDeath is an unkillable force which can only be killed by being voted out, even their lover dying won't kill them.\\\nThe Reaper or Death needs to be the last killer alive to win the game."
  }
}