{
  "crewmate": {
    "Guesser": "The Guesser can be a Crewmate or an Impostor (depending on the settings).\nThe Guesser can shoot players during the meeting, by guessing its role. If the guess is wrong, the Guesser dies instead.\nYou can select how many players can be shot per game and if multiple players can be shot during a single meeting.\nThe guesses Impostor and Crewmate are only right, if the player is part of the corresponding team and has no special role.\nYou can only shoot during the voting time.\nDepending on the options, the Guesser can't guess the shielded player and depending on the Medic options the Medic/shielded player might be notified (no one will die, independently of what the Guesser guessed).\n\nNOTE:\n- If a player gets shot, you'll get back your votes\n- Jester wins won't be triggered, if the Guesser shoots the Jester before the Jester gets voted out",
    "Mayor": "The Mayor leads the Crewmates by having a vote that counts twice.\nThe Mayor can always use their meeting, even if the maximum number of meetings was reached.\nThe Mayor has a portable Meeting Button, depending on the options.\nThe Mayor can see the vote colors after completing a configurable amount of tasks, depending on the options.\nThe Mayor has the option to vote with only one vote instead of two (via a button in the meeting screen), depending on the settings.",
    "Engineer": "The Engineer (if alive) can fix a certain amount of sabotages per game from anywhere on the map.\nThe Engineer can use vents.\nIf the Engineer is inside a vent, depending on the options the members of the team Jackal/Impostors will see a blue outline around all vents on the map (in order to warn them).\nNOTE:\n- The kill button of Impostors activates if they stand next to a vent where the Engineer is. They can also kill them there. No other action (e.g. Morphling sample, Shifter shift, ...) can affect players inside vents.",
    "Sheriff": "The Sheriff has the ability to kill Impostors or Neutral roles if enabled.\nIf they try to kill a Crewmate, they die instead.\n\nNOTE:\n- If the Sheriff shoots the person the Medic shielded, the Sheriff and the shielded person both remain unharmed.\n- If the Sheriff shoots a Mini Impostor while growing up, nothing happens. If it's fully grown, the Mini Impostor dies.",
    "Deputy": "The Deputy has the ability to handcuff player.\nHandcuffs will be hidden until the handcuffed player try to use a disabled button/hotkey.\nHandcuffs disable:\n- Kill\n- Abilities\n- Vent\n- Report\n\nNOTE:\n- Duration starts after the handcuffs become visible.\n- Deputy can not be in game without Sheriff.",
    "Lighter": "The Lighter has a different vision than everyone else depending on the settings.\nTheir vision looks like a flashlight cone which can be moved around (known from the Hide'n'Seek mode).",
    "Detective": "The Detective can see footprints that other players leave behind.\nThe Detective's other feature shows when they report a corpse: they receive clues about the killer's identity. The type of information they get is based on the time it took them to find the corpse.\nNOTE:\n- When people change their colors (because of a morph or camouflage), all the footprints also change their colors (also the ones that were already on the ground). If the effects are over, all footprints switch back to the original color.\n- The Detective does not see footprints of players that sit in vents\n- More information about the [colors](#colors)",
    "Time Master": "The Time Master has a time shield which they can activate. The time shield remains active for a configurable amount of time.\nIf a player tries to kill the Time Master while the time shield is active, the kill won't happen and the\ntime will rewind for a set amount of time.\nThe kill cooldown of the killer won't be reset, so the Time Master\nhas to make sure that the game won't result in the same situation.\nThe Time Master won't be affected by the rewind.\nNOTE:\n- Only the movement is affected by the rewind.\n- A Vampire bite will trigger the rewind. If the Time Master misses shielding the bite, they can still shield the kill which happens a few seconds later.\n- If the Time Master was bitten and has their shield active before when a meeting is called, they survive but the time won't be rewound.\n- If the Time Master has a Medic shield, they won't rewind.\n- The shield itself ends immediately when triggered. So the Time Master can be attacked again as soon as the rewind ends.",
    "Medic": "The Medic can shield (highlighted by an outline around the player) one player per game, which makes the player unkillable.\\ The shield is also shown in the meeting as brackets around the shielded player's name.\nThe shielded player can still be voted out and might also be an Impostor.\nIf set in the options, the shielded player and/or the Medic will get a red flash on their screen if someone (Impostor, Sheriff, ...) tried to murder them.\nIf the Medic dies, the shield disappears with them.\nThe Sheriff will not die if they try to kill a shielded Crewmate and won't perform a kill if they try to kill a shielded Impostor.\nDepending on the options, guesses from the Guesser will be blocked by the shield and the shielded player/medic might be notified.\nThe Medic's other feature shows when they report a corpse: they will see how long ago the player died.\nNOTE:\n- If the shielded player is a Lover and the other Lover dies, they nevertheless kill themselves.\n- If the Shifter has a shield or their target has a Shield, the shielded player switches.\n- Shields set after the next meeting, will be set before a possible shift is being performed.",
    "Swapper": "During meetings the Swapper can exchange votes that two people get (i.e. all votes\nthat player A got will be given to player B and vice versa).\nBecause of the Swapper's strength in meetings, they might not start emergency meetings and can't fix lights and comms.\nThe Swapper now has initial swap charges and can recharge those charges after completing a configurable amount of tasks.\n\nNOTE:\n- The remaining charges will be displayed in brackets next to the players role while not in a meeting\n- In a meeting the charges will appear next to the Confirm Swap button",
    "Seer": "The Seer has two abilities (one can activate one of them or both in the options).\nThe Seer sees the souls of players that died a round earlier, the souls slowly fade away.\nThe Seer gets a blue flash on their screen, if a player dies somewhere on the map.",
    "Hacker": "If the Hacker activates the \"Hacker mode\", the Hacker gets more information than others from the admin table and vitals for a set duration.\nOtherwise they see the same information as everyone else.\nAdmin table: The Hacker can see the colors (or color types) of the players on the table.\nVitals: The Hacker can see how long dead players have been dead for.\nThe Hacker can access his mobile gadgets (vitals & admin table), with a maximum of charges (uses) and a configurable amount of tasks needed to recharge.\nWhile accessing those mobile gadgets, the Hacker is not able to move.\nNOTE:\n- If the Morphling morphs or the Camouflager camouflages, the colors on the admin table change accordingly\n- More information about the [colors](#colors)",
    "Tracker": "The Tracker can select one player to track. Depending on the options the Tracker can track a different person after each meeting or the Tracker tracks the same person for the whole game.\nAn arrow points to the last tracked position of the player.\nThe arrow updates its position every few seconds (configurable).\nBy an option, the arrow can be replaced or combined with the Proximity Tracker from Hide N Seek.\nDepending on the options, the Tracker has another ability: They can track all corpses on the map for a set amount of time. They will keep tracking corpses, even if they were cleaned or eaten by the Vulture.\nNOTE\n- If the tracked player is on a different floor on Submerged, the arrow will always point to the elevator",
    "Snitch": "When the Snitch finishes all their tasks, they will get information in chat of the last location of all killers when the meeting starts.\nWhen the Snitch only has a configurable amount of tasks left, it will be revealed that there is a Snitch in the game with a text on evil player's screens.\nNOTE:\n- If the Snitch dies, all killers will be informed that the Snitch is dead\n- Last location can be a room or open field",
    "Spy": "The Spy is a Crewmate, which has no special abilities.\nThe Spy looks like an additional Impostor to the Impostors, they can't tell the difference.\nThere are two possibilities (depending on the set options):\n- The Impostors can't kill the Spy (because otherwise their kill button would reveal, who the Spy is)\n- The Impostors can kill the Spy but they can also kill their Impostor partner (if they mistake another Impostor for the Spy)\nYou can set whether the Sheriff can kill the Spy or not (in order to keep the lie alive).\nNOTE:\n- If the Spy gets sidekicked, it still will appear red to the Impostors.",
    "Portalmaker": "The Portalmaker is a Crewmate that can place two portals on the map.\nThese two portals are connected to each other.\nThose portals will be visible after the next meeting and can be used by everyone.\nAdditionally to that, the Portalmaker gets information about who used the portals and when in the chat during each meeting, depending on the options.\nThe Portalmaker can teleport themself to their placed portals from anywhere if the setting is enabled.\nNOTE:\n- The extra button to use a portal will appear after the Portalmaker set their portals and a meeting/body report was called.\n- While one player uses a portal, it is blocked for any other player until the player got teleported.\n- All ghosts can still use the portals, but won't block any living player from using it and the Portalmaker won't get any information about it in chat.\n- If a morphed person uses a portal it will show the morphed name/color depending on the options.\n- If a camouflaged person uses a portal it will show \"A comouflaged person used the portal.\"",
    "Security Guard": "The Security Guard is a Crewmate that has a certain number of screws that they can use for either sealing vents or for placing new cameras.\nPlacing a new camera and sealing vents takes a configurable amount of screws. The total number of screws that a Security Guard has can also be configured.\nThe new camera will be visible after the next meeting and accessible by everyone.\nThe vents will be sealed after the next meeting, players can't enter or exit sealed vents, but they can still \"move to them\" underground.\nNOTE:\n- Trickster boxes can't be sealed\n- The Security Guard can't place cameras on MiraHQ\n- The remaining number of screws can be seen above their special button.\n- On Skeld the four cameras will be replaced every 3 seconds (with the next four cameras). You can also navigate manually using the arrow keys\n- Security Guard can access mobile cameras after placing all screws\n- While accessing the mobile cameras, the Security Guard is not able to move",
    "Medium": "The medium is a crewmate who can ask the souls of dead players for information. Like the Seer, the medium will see the souls of the players who have died (after the next meeting) and can question them. They then gets random information about the soul or the killer in the chat. The souls only stay for one round, i.e. until the next meeting. Depending on the options, the souls can only be questioned once and then disappear.\n\nQuestions:\nThe souls will always prefer to answer with the role specific information first!\nRole specific:\n- Sheriff suicide: \"Yikes, that Sheriff shot backfired.\"\n- Thief suicide: \"I tried to steal the gun from their pocket, but they were just happy to see me.\"\n- Active Lover dies: \"I wanted to get out of this toxic relationship anyways.\"\n- Passiv Lover suicide: \"The love of my life died, thus with a kiss I die.\"\n- Lawyer client kills Lawyer: \"My client killed me. Do I still get paid?\"\n- Teamkill Jackal/Sidekick: \"First they sidekicked me, then they killed me... BUT WHY?\"\n- Teamkill Impostor: \"I guess they confused me for the Spy, is there even one?\"\n- Submerged o2-Kill: \"Do I really need that mask for breathing?\"\n- Warlock self kill: \"MAYBE I cursed the person next to me and killed myself. Oops.\"\n- Vulture/Cleaner eats/cleans body: \"Is my dead body some kind of art now or... aaand it's gone.\"\nElse random:\n- \"I'm not sure, but I guess a darker/lighter color killed me.\"\n- \"If I counted correctly, then I died x seconds before the meeting started.\"\n- \"If my role hasn't been saved, there's no (role) in the game anymore.\"\n- \"It seems like my killer was the (role).\"\nChance That The Answer Contains Additional Information:\n- When you asked, x killer(s) was/were still alive.\n- When you asked, x player(s) who can use vents was/were still alive.\n- When you asked, x player(s) who is/are neutral but cannot kill was/were still alive.",
    "Trapper": "The Trapper is a crewmate which can set up traps to trap player and gain information from them.\nThe traps will stuck player for x-seconds (depends on the setting) and reveal information in chat\nabout their \"Role\", if they are a \"Good/Evil Role\" or their \"Name\".\nThe trap is not visible until a configurable amount of player were trapped.\nWhen the trap gets visible, the Trapper will gain the information in chat (in a random order).\nIf a trap is triggered (and the option is enabled), the map of the Trapper will open up and show which trap\nwas triggered.\nThe traps have a maximum of charges (uses) and a configurable amount of tasks are needed to recharge.\n\nNOTE:\n- The Trapper can't be trapped in their own trap(s).",
    "Bloody": "If killed, the Bloody Modifier will leave a trail for x-seconds on their killer. The trail will have the color of the killed person.\n\nNOTE\n- Impostor, Neutral or Crewmate roles can have this Modifier",
    "Anti Teleport": "The Anti Teleport Modifier prevents the player from getting teleported to the Meeting Table if a body gets reported or an Emergency Meeting is called.\nThe player will start the round where the previous one ended (Emergency Meeting Call/Body Report).\n\nNOTE\n- Impostor, Neutral or Crewmate roles can have this Modifier",
    "Tie Breaker": "If the Voting ends in a tie, the Tie Breaker takes place and the player with the Tie Breaker Modifier gets an extra vote thats not visible to anyone.\nEveryone will know if the Tie Breaker was involved in the Meeting or not.\n\nNOTE\n- Impostor, Neutral or Crewmate roles can have this Modifier\n- There can only be on player with this Modifier",
    "Bait": "The Bait forces the killer to self report the body (you can configure a delay in the options).\nThere can be more than one Bait.\nNOTE:\n- If the Sheriff has the Bait Modifier and dies while trying to kill a Crewmate, the Sheriff will NOT report themself.\n- Impostor, Neutral or Crewmate roles can have this Modifier",
    "Lovers": "There are always two Lovers which are linked together.\nTheir primary goal is it to stay alive together until the end of the game.\nIf one Lover dies (and the option is activated), the other Lover suicides.\nYou can specify the chance of one Lover being an Impostor.\nThe Lovers never know the role of their partner, they only see who their partner is.\nThe Lovers win, if they are both alive when the game ends. They can also win with their original team (e.g. a dead Impostor Lover can win with the Impostors, an Arsonist Lover can still achieve an Arsonist win).\nIf one of the Lovers is a killer (i.e. Jackal/Sidekick/Impostor), they can achieve a \"Lovers solo win\" where only the Lovers win.\nIf there is no killer among the Lovers (e.g. an Arsonist Lover + Crewmate Lover) and they are both alive when the game ends, they win together with the Crewmates.\nIf there's an Impostor/Jackal + Crewmate Lover in the game, the tasks of a Crewmate Lover won't be counted (for a task win) as long as they're alive.\nIf the Lover dies, their tasks will also be counted.\nYou can enable an exclusive chat only for Lovers.\nNOTE:\nIn a 2 Crewmates vs 2 Impostors (or 2 members of team Jackal) and the Lovers are not in the same team, the game is not automatically over since the Lovers can still achieve a solo win. E.g. if there are the following roles Impostor + ImpLover + Lover + Crewmate left, the game will not end and the next kill will decide if the Impostors or Lovers win.",
    "Sunglasses": "The Sunglasses will lower the Crewmate's vision by a small percentage. The percentage is configurable in the options.\nThe vision will also be affected when lights out.\nNOTE:\n- Sunglasses only affects Crewmates.\n- If you have the Sunglasses Modifier and get sidekicked, you will lose the Modifier.",
    "Mini": "The Mini's character is smaller and hence visible to everyone in the game.\nThe Mini cannot be killed until it turns 18 years old, however it can be voted out.\nImpostor/Jackal Mini:\n- While growing up the kill cooldown is doubled. When it's fully grown up its kill cooldown is 2/3 of the default one.\n- If it gets thrown out of the ship, everything is fine.\nCrewmate Mini:\n- The Crewmate Mini aims to play out the strength its invincibility in the early game.\n- If it gets thrown out of the ship before it turns 18, everyone loses. So think twice before you vote out a Mini.\nNeutral Mini:\n- The cooldown is not effected, except for the Team Jackal/Sidekick.\n- If it gets thrown out of the ship, everything is fine except for the Jester.\n- If the Jester Mini gets voted out the game will end in a Jester win.\nNOTE:\n- If the Sheriff tries to kill the Mini before it's fully grown, nothing happens.\n- The Sheriff can kill the Impostor/Neutral Mini, but only if it's fully grown up.\n- If the Mini's primary role is guessed correctly, it dies like every other role and nothing further happens.",
    "VIP": "An Impostor, Jackal or Crewmate can be affected by the VIP (Very Important Player) Modifier.\nThe VIP will show everyone when he dies with a flash similar to the Seer Flash.\nIf the option Show Team Color is On, then everyone will get a flash in the color of the team the player was part of.\nTeams:\n- Impostor = Red\n- Neutral = Blue\n- Crewmate = White",
    "Invert": "The Invert Modifier inverts your controls (no matter if keyboard or mouse).\n\nNOTE\n- Impostor, Neutral or Crewmate roles can have this Modifier",
    "Chameleon": "The Chameleon becomes (partially or fully) invisible when standing still for x-seconds (depends on the settings).\n\nNOTE\n- You can use abilities while being invisible, only moving will make you visible again\n- Impostor, Neutral or Crewmate roles can have this Modifier",
    "Shifter": "The Shifter is a Modifier that can shift with another player. If the other player is Crewmate as well, they will swap their roles.\nSwapping roles with an Impostor or Neutral fails and the Shifter commits suicide after the next meeting (there won't be a body).\nThe Shift will always be performed at the end of the next meeting right before a player is exiled. The target needs to be chosen during the round.\nEven if the Shifter or the target dies before the meeting, the Shift will still be performed.\n\nNOTE:\n- The Shifter shift will always be triggered before the Erase (hence either the new role of the Shifter will be erased or the Shifter gets the role of their target, depending on whom the Eraser erased)\n- One time use abilities (e.g. shielding a player or Engineer sabotage fix) can only used by one player in the game (i.e. the Shifter\ncan only use them, if the previous player did not use them before)\n- The Shifter button is located in the bottom left corner right next to the garlic button (if the Vampire is enabled)\n- Only a Crewmate role can have this Modifier",
    "Armored": "The Armored is a Modifier that protects the player from the first shot that would have killed them. There can only be one Armored player per round.\n\nNOTE:\n- Armored is only active during the round and does not protect from guesses or votes.\n- Armored is applied after all other shields or protections, so that the Armor only breaks if the player would have otherwise died.\n- If a killer tries to kill the Armored, they will see the Armor break with a nice animation.\n- The Armored player has no indicator whatsoever if the Armor is still active, unless they break it (Warlock, Sheriff, Thief)"
  },
  "impostor": {
    "Mafia": "The Mafia are a group of three Impostors.\nThe Godfather works like a normal Impostor.\nThe Mafioso is an Impostor who cannot kill until the Godfather is dead.\nThe Janitor is an Impostor who cannot kill, but they can hide dead bodies instead.\n\nNOTE:\n- There have to be 3 Impostors activated for the mafia to spawn.",
    "Morphling": "The Morphling is an Impostor which can additionally scan the appearance of a player.\nAfter an arbitrary time they can take on that appearance for a set duration which can be changed in the options.\n\nNOTE:\n- They shrink to the size of the Mini when they copy its look.\n- The Hacker sees the new color on the admin table.\n- The color of the footprints changes accordingly (also the ones that were already on the ground).\n- The other Impostor still sees that they are an Impostor (the name remains red).\n- The shield indicator changes accordingly (the Morphling gains or loses the shield indicator).\n- Tracker arrows keep working.",
    "Camouflager": "The Camouflager is an Impostor which can additionally activate a camouflage mode.\nThe camouflage mode lasts for x-seconds (configurable) and while it is active, all player names/pets/hats\nare hidden and all players have the same color.\n\nNOTE:\n- The Mini will look like all the other players\n- The color of the footprints turns gray (also the ones that were already on the ground).\n- The Hacker sees gray icons on the admin table\n- The shield is not visible anymore\n- Tracker arrows keep working",
    "Vampire": "The Vampire is an Impostor, that can bite other player. Bitten players die after a configurable amount of time.\nIf the Vampire spawn chance is greater 0 (even if there is no Vampire in the game), all players can place one garlic.\nIf a victim is near a garlic, the \"Bite Button\" turns into the default \"Kill Button\" and the Vampire can only perform a normal kill.\n\nNOTE:\n- If a bitten player is still alive when a meeting is being called, they die at the start of the meeting.\n- The cooldown is the same as the default kill cooldown (+ the kill delay if the Vampire bites the target).\n- If there is a Vampire in the game, there can't be a Warlock.\n- If the Vampire bites a player and the Thief kills the Vampire, the bite will still be performed, but the new Vampire will be displayed in the kill animation.\n- If the Vampire bites a player and gets killed before the bite is performed, the biten player will survive.",
    "Eraser": "The Eraser is an Impostor that can erase the role of every player.\nThe targeted players will lose their role after the meeting right before a player is exiled.\nAfter every erase, the cooldown increases by 10 seconds.\nThe erase will be performed, even if the Eraser or their target die before the next meeting.\nBy default the Eraser can erase everyone but the Spy and other Impostors.\nDepending on the options they can also erase them (Impostors will lose their special Impostor ability).\n\nNOTE:\n- The Shifter shift will always be triggered before the Erase (hence either the new role of the Shifter will be erased or the Shifter saves the role of their target, depending on whom the Eraser erased).\n- As the erase is being triggered before the ejection of a player, a Jester win would not happen, as the erase will be triggered before.\n- Modifier will not be erased.",
    "Trickster": "The Trickster is an Impostor that can place 3 jack-in-the-boxes that are invisible at first to other players.\nIf the Trickster has placed all of their boxes they will be converted into a vent network after the next Meeting, usable only by the Trickster themself, but the boxes are also revealed to the others.\nIf the boxes are converted to a vent network, the Trickster gains a new ability \"Lights out\" to limit the visibility of Non-Impostors, that cannot be fixed by other players. Lights are automatically restored after a while.\n\nNOTE:\n- Impostors will get a text indicator at the bottom of the screen to notify them if the lights are out due to the Trickster ability, as there is no sabotage arrows or task to sabotage text to otherwise notify them about it.",
    "Cleaner": "The Cleaner is an Impostor who has the ability to clean up dead bodies.\n\nNOTE:\n- The Kill and Clean cooldown are shared, preventing them from immediately cleaning their own kills.\n- If there is a Cleaner in the game, there can't be a Vulture.",
    "Warlock": "The Warlock is an Impostor, that can curse another player (the cursed player doesn't get notified).\nIf the cursed person stands next to another player, the Warlock is able to kill that player (no matter how far away they are).\nPerforming a kill with the help of a cursed player, will lift the curse and it will result in the Warlock being unable to move for a configurable amount of time.\nThe Warlock can still perform normal kills, but the two buttons share the same cooldown.\n\nNOTE:\n- The Warlock can always kill their Impostor mates (and even themself) using the \"cursed kill\"\n- If there is a Warlock in the game, there can't be a Vampire\n- Performing a normal kill, doesn't lift the curse",
    "Bounty Hunter": "The Bounty Hunter is an Impostor, that continuously get bounties (the targeted player doesn't get notified).\nThe target of the Bounty Hunter swaps after every meeting and after a configurable amount of time.\nIf the Bounty Hunter kills their target, their kill cooldown will be a lot less than usual.\nKilling a player that's not their current target results in an increased kill cooldown.\nDepending on the options, there'll be an arrow pointing towards the current target.\n\nNOTE:\n- The target won't be an Impostor, a Spy or the Bounty Hunter's Lover.\n- Killing the target resets the timer and a new target will be selected.",
    "Witch": "The Witch is an Impostor who has the ability to cast a spell on other players.\nDuring the next meeting, the spellbound player will be highlighted and they'll die right after the meeting.\nThere are multiple options listed down below with which you can configure to fit your taste.\nSimilar to the Vampire, shields and blanks will be checked twice (at the end of casting the spell on the player and at the end of the meeting, when the spell will be activated).\nThis can result in players being marked as spelled during the meeting, but not dying in the end (when they get a shield or the Witch gets blanked after they were spelled by the Witch).\nIf the Witch dies before the meeting starts or if the Witch is being guessed during the meeting, the spellbound players will be highlighted but they'll survive in any case.\nDepending on the options you can choose whether voting the Witch out will save all the spellbound players or not.\n\nNOTE:\n- The spellbound players will die before the voted player dies (which might trigger e.g. trigger an Impostor win condition, even if the Witch is the one being voted)",
    "Ninja": "The Ninja is an Impostor who has the ability to kill another player all over the map.\nYou can mark a player with your ability and by using the ability again, you jump to the position of the marked player and kill it.\nDepending on the options you know where your marked player is.\nIf the Ninja uses its ability, it will leave a trace (leaves) for a configurable amount of time where it activated the ability and additionally where it killed the before marked player.\nWhen performing a ninja ability kill, the ninja can be invisible for some seconds (depends on options)\n\nNOTE:\n- The Ninja has a 5 second cooldown after marking a player\n- The trace has a darker (black) or lighter (white) color depending on the players color that will fade into green\n- The mark on the marked player will reset after a meeting or after using the ability to kill the marked player. Performing a normal kill will NOT reset the mark\n- If the Ninja tries to kill a shielded player (e.g. Medic shield, Shield last game first kill ), the kill will not be performed\n- If the Ninja tries to kill the Time Master while the shield is active, the Ninja won't teleport to the players position, but the Time Master shield will still be activated\n- If the marked target is on a different floor on Submerged, the arrow will always point to the elevator",
    "Bomber": "The Bomber is an Impostor who has the ability to be very explosive. They have the ability to plant bombs to spread grouping Crewmates and also kill them.\nThe Bomber also has the ability to perform a normal kill like all Impostors.\nThe plant time of the bomb can be different to the kill cooldown depending on the settings.\nCrewmates can defuse a bomb depending on the settings.\nNOTE:\n- The bomb won't kill a shielded player (Medic, First Kill Shield)\n- The bomb won't kill a Mini until it's grown up\n- The bomb can kill the bomber as well as their teammate(s)\n- The hearing range can be higher/lower than the actual destruction range, depending on the settings, and has a visual indicator\n- The visual indicator slowly fades into red until the bomb explodes and it does not show the explosion range (only hearing range)!\n- The bomb can be defused by standing on it and snipping the fuse (button)",
    "YoYo": "The Yo-Yo is an Impostor who has the ability mark a position and later blink (teleport) to this position.\nAfter the initial blink, the Yo-Yo has a fixed amount of time (option) to do whatever they want, before automatically blinking back to the starting point of the first blink.\nEach blink leaves behind a silhouette with configurable transparency. The silhouette is very hard to see.\nThe Yo-Yo may also have access to a mobile admin table, depending on the settings.\nNOTE:\n- The marked position for the first jump's target is displayed to the Yo-Yo and ghosts only.\n- The silhouette of the first blink stays (almost) until the Yo-Yo returns\n- The silhouette of the second blink (return) stays for 5 seconds"
  },
  "neutral": {
    "Jester": "The Jester does not have any tasks. They win the game as a solo, if they get voted out during a meeting.",
    "Arsonist": "The Arsonist does not have any tasks, they have to win the game as a solo.\nThe Arsonist can douse other players by pressing the douse button and remaining next to the player for a few seconds.\nIf the player that the Arsonist douses walks out of range, the cooldown will reset to 0.\nAfter dousing everyone alive the Arsonist can ignite all the players which results in an Arsonist win.",
    "Jackal": "Team: Jackal\nThe Jackal is part of an extra team, that tries to eliminate all the other players.\nThe Jackal has no tasks and can kill Impostors, Crewmates and Neutrals.\nThe Jackal (if allowed by the options) can select another player to be their Sidekick.\nCreating a Sidekick removes all tasks of the Sidekick and adds them to the team Jackal. The Sidekick loses their current role (except if they're a Lover, then they play in two teams).\nThe \"Create Sidekick Action\" may only be used once per Jackal or once per game (depending on the options).\nThe Jackal can also promote Impostors to be their Sidekick, but depending on the options the Impostor will either really turn into the Sidekick and leave the team Impostors or they will just look like the Sidekick to the Jackal and remain as they were.\nAlso if a Spy or Impostor gets sidekicked, they still will appear red to the Impostors.\nThe team Jackal enables multiple new outcomes of the game, listing some examples here:\n- The Impostors could be eliminated and then the crew plays against the team Jackal.\n- The Crew could be eliminated, then the Team Jackal fight against the Impostors (The Crew can still make a task win in this scenario)\nThe priority of the win conditions is the following:\n1. Jester wins by vote (even as Mini)\n2. Crewmate Mini lose by vote\n3. Arsonist win\n4. Team Impostor wins by sabotage\n5. Team Crew wins by tasks (also possible if the whole Crew is dead)\n6. Lovers among the last three players win\n7. Team Jackal wins by outnumbering (When the team Jackal contains an equal or greater amount of players than the Crew and there are 0 Impostors left and team Jackal contains no Lover)\n8. Team Impostor wins by outnumbering (When the team Impostors contains an equal or greater amount of players than the Crew and there are 0 players of the team Jackal left and team Impostors contains no Lover)\n9. Team Crew wins by outnumbering (When there is no player of the team Jackal and the team Impostors left)\nNOTE:\n- The Jackal (and their Sidekick) may be killed by a Sheriff.\n- A Jackal cannot target the Mini, while it's growing up. After that they can kill it or select it as its Sidekick.\n- The Crew can still win, even if all of their members are dead, if they finish their tasks fast enough (That's why converting the last Crewmate with tasks left into a Sidekick results in a task win for the crew.)\nIf both Impostors and Jackals are in the game, the game continues even if all Crewmates are dead. Crewmates may still win in this case by completing their tasks. Jackal and Impostor have to kill each other.",
    "Sidekick": "Team: Jackal\nGets assigned to a player during the game by the \"Create Sidekick Action\" of the Jackal and joins the Jackal in their quest to eliminate all other players.\nUpon the death of the Jackal (depending on the options), they might get promoted to Jackal themself and potentially even assign a Sidekick of their own.\n\nNOTE:\n- A player that converts into a Sidekick loses their previous role and tasks (if they had one).\n- The Sidekick may be killed by a Sheriff.\n- The Sidekick cannot target the Mini, while it's growing up.",
    "Vulture": "The Vulture does not have any tasks, they have to win the game as a solo.\nThe Vulture is a neutral role that must eat a specified number of corpses (depending on the options) in order to win.\nDepending on the options, when a player dies, the Vulture gets an arrow pointing to the corpse.\nIf there is a Vulture in the game, there can't be a Cleaner.\nNOTE\n- If the corpse is on a different floor on Submerged, the arrow will always point to the elevator",
    "Lawyer": "The Lawyer is a neutral role that has a client.\nThe client might be an Impostor or Jackal which is no Lover.\nDepending on the options, the client can also be a Jester.\nThe Lawyer needs their client to win in order to win the game.\nTheir client doesn't know that it is their client.\nIf their client gets voted out, the Lawyer dies with the client.\nIf their client dies, the Lawyer changes their role and becomes the [Pursuer](#pursuer), which has a different goal to win the game.\n\nHow the Lawyer wins:\n- Lawyer dead/alive, client alive and client wins: The Lawyer wins together with the team of the client.\n- If their client is Jester and the Jester gets voted out, the Lawyer wins together with the Jester.\nNOTE:\n- If the client disconnects, the Lawyer will also turn into the Pursuer.\n- The Lawyer needs to figure out the role of their client depending on the options.\n- The tasks only count, if the Lawyer gets promoted to Pursuer.\n- If the Lawyer dies before their client, they will lose all their tasks and will get the overview immediately.",
    "Prosecutor": "The Prosecutor is a neutral role that resembles the Lawyer. The Prosecutor has a client who is a Crewmate.\nThe Prosecutor needs their client to be voted out in order to win the game.\nThe Prosecutor's client doesn't know that they are their client.\nIf the client gets sidekicked, the Prosecutor changes their role and becomes the client's [Lawyer](#lawyer) and has to protect the\nclient from now on.\nIf the Prosecutor's client dies, the Prosecutor changes their role and becomes the [Pursuer](#pursuer), which has a different goal to win the game.\nNOTE:\n- The Prosecutor's role settings are shared with the Lawyer settings.\n- If the client disconnects, the Prosecutor will also turn into the Pursuer.\n- The Prosecutor needs to figure out the role of their client depending on the options.\n- The tasks only count, if the Prosecutor gets promoted to Pursuer.\n- If the Prosecutor dies before their client, they will lose all their tasks and will get the overview immediately.",
    "Pursuer": "The Pursuer is still a neutral role, but has a different goal to win the game; they have to be alive when the game ends and the Crew wins.\nIn order to achieve this goal, the Pursuer has an ability called \"Blank\", where they can fill a killer's (this also includes the Sheriff) weapon with a blank. So, if the killer attempts to kill someone, the killer will miss their target, and their cooldowns will be triggered as usual.\nIf the killer fires the \"Blank\", shields (e.g. Medic shield or Time Master shield) will not be triggered.\nThe Pursuer has tasks (which can already be done while being a Lawyer/Prosecutor), that count towards the task win for the Crewmates. If the Pursuer dies, their tasks won't be counted anymore.",
    "Thief": "The Thief has to kill another killer (Impostor, Jackal/Sidekick and if enabled Sheriff)\nin order to have a win condition.\nIf the Thief doesn't kill another killer they will lose the game.\nIf the Thief kills one of the other killers, the Thief overtakes their role (e.g. Ninja) and joins their team (in this case\nteam Impostor). They then have the new Role's win condition (e.g. Impostor-Win).\nIf the Thief tries to kill any non-killing role (Crewmate or Neutral), they die similar to a misfiring Sheriff.\n\nNOTE\n- If the option \"Thief Can Kill Sheriff\" is On, the Thief has tasks which will ONLY begin to count, if they kill\nthe Sheriff. While the Thief hasn't fired, their tasks do not count towards the taskwin.\n- If the option \"Thief Can Kill Sheriff\" is Off, the Thief will not have tasks.\n- If the Thief kills the witch, already witched players stay witched (except for the Thief).\n- If the Thief can guess to steal the role, guessing the witch will either save all targets or none of the targets (depending on the setting for Witch: Voting The Witch Saves All The Targets)"
  },
  "modifier": {
    "Guesser Modifier": "The Guesser-Gamemode is an extension to the Classic-Gamemode and gives you a multitude of new options for Guessers.\nThe Guesser is now like an addition and can be applied to all players IF you want to. Settings are available to set the number of guessers for each team separately (Impostor, Neutral, Crewmate).\nWhen playing this game mode, the Guessers can have another role (e.g. Medic Guesser). The same\napplies of course for Impostor and/or Neutral roles.\nPlayers can additionally have a modifier, if enabled (e.g. Medic Guesser Mini).",
    "PropHunt": "The Prop-Gamemode is a standalone Gamemode where Hunters have to find the disguised players (\"Props\").\nThe Hunters and Props who are still alive are displayed to everyone in the bottom left corner (similar to the Arsonist display).\nWhen the game starts, the Hunter's movement is disabled for x-seconds (depends on the settings), and their screen is blacked out.\nThere is a time-limit for each round, if the timer runs out and at least one Prop is still alive, the remaining Props win.\nIf the Hunters kill all players before the timer runs out the Hunters win.\nWhen a Prop dies, they will either join the Hunter team or die (setting).\nShared Abilities:\n- Unstuck: By pressing this button, you can travel through walls for a short time. This is needed, because props sometimes get stuck in walls, due to their changed colliders. Don't use it to cheat!\nHunter Abilities:\n- Reveal: A random players current prop is revealed to all players for x seconds (according to settings). The timer will be reduced by punish s.\n- Mobile Admin table (like Hacker) - Normal Admin table shares the cooldown\n- Find: Display the DangerMeter known from Vanilla HideNSeek for x seconds. The dangerlevel is rising the closer the Hunter gets to the neares prop.\nProp Abilities:\n- Invisibility: As a disguised Prop, become invisible for x seconds.\n- Speedboost: Move faster for x seconds.\n- Disguise: While near a usable object, press the button to disguise as the displayed object!\nNOTE:\n- The Report button lights up, but cannot be pressed.\n- Hunters can vent\n- The Kill Button and Vent Button are permanently enabled, so that you cannot use them to check if there is a prop nearby\n- The Kill Button can always be pressed, but you can also miss if no Prop is nearby. The cooldown can be configured for hits and misses seperately.\n- Usable prop objects are: All task consoles as well as many objects (rocks, snowpeople, barriers, beds, tables, ...)\n- Any object on LevelImposter maps, that contains `liprop` in its name and has a `SpriteRenderer` (+ Sprite) will be usable as a prop too!",
    "GCERROR": "If the error message \"Fatal Error in GC - Collecting from unknown thread\" stops you from playing the game, you can now disable the mod-updater, which causes this error.\nIn order to do this, create a file called `noupdater.txt` in your modded Among Us folder.\nLicense\nTheOtherRolesAU/TheOtherRoles is licensed under the\n[GNU General Public License v3.0](https://github.com/TheOtherRolesAU/TheOtherRoles/blob/main/LICENSE)\nPermissions of this strong copyleft license are conditioned on making available complete source code of licensed works and modifications, which include larger works using a licensed work, under the same license. Copyright and license notices must be preserved. Contributors provide an express grant of patent rights.\nBugs, suggestions and requests\nIf you found any bugs, have an idea for a new role or any other request, join our [Discord server](https://discord.gg/77RkMJHWsM).\nCopyedit\nThanks for fixing our typos [jacktose](https://github.com/jacktose) ✌️"
  }
}