{
  "crewmate": {
    "Altruist": "The Altruist is a Crewmate that is capable of reviving dead players.\nUpon finding a dead body, the Altruist can hit their revive button, risking sacrificing themselves for the revival of another player.\nIf enabled, the dead body disappears, so only the Altruist's body remains at the scene.\nAfter a set period of time, the player will be resurrected, if the revival isn't interrupted.",
    "Aurial": "The Aurial is a Crewmate that can sense things in their surrounding Aura.\nIf any player near the Aurial uses a button ability, the Aurial will get an arrow pointing towards where that ability was used.",
    "Deputy": "The Deputy is a Crewmate that can camp other players.\nCamped players will alert the Deputy when they are killed.\nThe following meeting the Deputy then can attempt to shoot their killer.\nIf they successfully shoot the killer, they die, otherwise nothing happens.",
    "Detective": "The Detective is a Crewmate that can inspect crime scenes and then examine players.\nThe Detective must first find a crime scene and inspect it.\nDuring the same or following rounds the Detective can then examine players to see if they were the killer.\nIf the examined player is the killer or were near the crime scene at any point, they will receive a red flash, else the flash will be green.",
    "Engineer": "The Engineer is a Crewmate that can fix sabotages from anywhere on the map.\nThey can use vents to get across the map easily.",
    "Haunter": "The Haunter is a dead Crewmate that can reveal Impostors if they finish all their tasks.\nUpon finishing all of their tasks, Impostors are revealed to alive crewmates after a meeting is called.\nHowever, if the Haunter is clicked they lose their ability to reveal Impostors and are once again a normal ghost.",
    "Hunter": "The Hunter is a Crewmate Killing role with the ability to track players and execute them if they do anything suspicious.\nUnlike the Sheriff, the Hunter does not die if they kill an innocent player,\nhowever the Hunter may only execute players who have given them probable cause.",
    "Imitator": "The Imitator is a Crewmate that can mimic dead crewamtes.\nDuring meetings the Imitator can select who they are going to imitate the following round from the dead.\nThey can choose to use each dead players as many times as they wish.",
    "Investigator": "The Investigator is a Crewmate that can see the footprints of players.\nEvery footprint disappears after a set amount of time.",
    "Jailor": "The Jailor is a Crewmate that can jail Crewmates.\nDuring meetings all players can see when a Crewmate is jailed.\nWhen someone is jailed they cannot use any meeting ability and no meeting ability can be used on them.\nThe Jailor may privately communicate with the jailee.\nIf the Jailor then thinks the jailee is bad, they may then execute them.\nIf the Jailor executes incorrectly, they lose the ability to jail.",
    "Lookout": "The Lookout is a Crewmate that can watch other players during rounds.\nDuring meetings they will see all roles who interact with each watched player.",
    "Medic": "The Medic is a Crewmate that can give any player a shield that will make them immortal until the Medic dies.\nA Shielded player cannot be killed by anyone, unless by suicide.\nIf the Medic reports a dead body, they can get a report containing clues to the Killer's identity.\nA report can contain the name of the killer or the color type (Darker/Lighter)",
    "Medium": "The Medium is a Crewmate that can see ghosts.\nDuring each round the Medium has an ability called Mediate.\nIf the Medium uses this ability and no one is dead, nothing will happen.\nHowever, if someone is dead, the Medium and the dead player will be able to see each other and communicate from beyond the grave!",
    "Mystic": "The Mystic is a Crewmate that gets an alert revealing when someone has died.\nOn top of this, the Mystic briefly gets an arrow pointing in the direction of the body."
  },
  "impostor": {
    "Blackmailer": "The Blackmailer is an Impostor that can silence people in meetings.\nDuring each round, the Blackmailer can go up to someone and blackmail them.\nThis prevents the blackmailed person from speaking and possibly voting during the next meeting.",
    "Bomber": "The Bomber is an Impostor who has the ability to plant bombs instead of kill.\nAfter a bomb is planted, the bomb will detonate a fixed time period as per settings.\nOnce the bomb detonates it will kill all crewmates (and Impostors!) inside the radius.",
    "Escapist": "The Escapist is an Impostor that can teleport to a different location.\nOnce per round the Escapist can Mark a location which they can then escape to later in the round.",
    "Grenadier": "The Grenadier is an Impostor that can throw smoke grenades.\nDuring the game, the Grenadier has the option to throw down a smoke grenade which blinds crewmates so they can't see.\nHowever, a sabotage and a smoke grenade can not be active at the same time.",
    "Hypnotist": "The Hypnotist is an Impostor that can hypnotize people.\nOnce enough people are hypnotized, the Hypnotist can release Mass Hysteria.\nWith Mass Hysteria released, all hypnotized players see all other players as either themselves, camouflaged or invisible.\nOnce the Hypnotist dies Mass Hysteria is removed and people can see everyone normally again.",
    "Janitor": "The Janitor is an Impostor that can clean up bodies.\nBoth their Kill and Clean ability have a shared cooldown, meaning they have to choose which one they want to use.",
    "Miner": "The Miner is an Impostor that can create new vents.\nThese vents only connect to each other, forming a new passway.",
    "Morphling": "The Morphling is an Impostor that can Morph into another player.\nAt the beginning of the game and after every meeting, they can choose someone to Sample.\nThey can then Morph into that person at any time for a limited amount of time.",
    "Scavenger": "The Scavenger is an Impostor who hunts down prey.\nWith each successful hunt the Scavenger has a shortened kill cooldown.\nOn an incorrect kill the Scavenger has a significantly increased kill cooldown.",
    "Swooper": "The Swooper is an Impostor that can temporarily turn invisible.",
    "Traitor": "If all Impostors die before a certain point in the game, a random crewmate is selected to become the Traitor.\nThe Traitor has no additional abilities and their job is simply to avenge the dead Impostors.\nOnce this player has turned into the Traitor their alliance sits with the Impostors.",
    "Undertaker": "The Undertaker is an Impostor that can drag and drop bodies.",
    "Venerer": "The Venerer is an Impostor that gains abilities through killing.\nAfter their first kill, the Venerer can camouflage themself.\nAfter their second kill, the Venerer can sprint.\nAfter their third kill, every other player is slowed while their ability is activated.\nAll abilities are activated by the one button and have the same duration.",
    "Warlock": "The Warlock is an Impostor that can charge up their kill button.\nOnce activated the Warlock can use their kill button infinitely until they run out of charge.\nHowever, they do not need to fully charge their kill button to use it."
  },
  "neutral": {
    "Amnesiac": "The Amnesiac is a Neutral role with no win condition.\nThey have zero tasks and are essentially roleless.\nHowever, they can remember a role by finding a dead player.\nOnce they remember their role, they go on to try win with their new win condition.",
    "Arsonist": "The Arsonist is a Neutral role with its own win condition.\nThey have two abilities, one is to douse other players with gasoline.\nThe other is to ignite all doused players.\nThe Arsonist needs to be the last killer alive to win the game.",
    "Doomsayer": "The Doomsayer is a Neutral role with its own win condition.\nTheir goal is to assassinate 3 players to win.\nIf there are only 2 other people alive, the Doomsayer only needs to assassinate the remainder of the players.\nThey have an additional observe ability that hints towards certain player's roles.",
    "Executioner": "The Executioner is a Neutral role with its own win condition.\nTheir goal is to vote out a player, specified in the beginning of a game.\nIf that player gets voted out, they win the game.",
    "Guardian Angel": "The Guardian Angel is a Neutral role which aligns with the faction of their target.\nTheir job is to protect their target at all costs.\nIf their target loses, they lose.",
    "Jester": "The Jester is a Neutral role with its own win condition.\nIf they are voted out after a meeting, the game finishes and they win.\nHowever, the Jester does not win if the Crewmates, Impostors or another Neutral role wins.",
    "Juggernaut": "The Juggernaut is a Neutral role with its own win condition.\nThe Juggernaut's special ability is that their kill cooldown reduces with each kill.\nThis means in theory the Juggernaut can have a 0 second kill cooldown!\nThe Juggernaut is also a hidden role, meaning it will show up randomly and can not be toggled by percentages like other roles.\nThe Juggernaut needs to be the last killer alive to win the game.",
    "Phantom": "The Phantom is a Neutral role with its own win condition.\nThey become half-invisible when they die and has to complete all their tasks without getting caught.",
    "Plaguebearer": "The Plaguebearer is a Neutral role with its own win condition, as well as an ability to transform into another role.\nThe Plaguebearer has one ability, which allows them to infect other players.\nOnce infected, the infected player can go and infect other players via interacting with them.\nOnce all players are infected, the Plaguebearer becomes Pestilence.\nThe Pestilence is a unkillable force which can only be killed by being voted out, even their lover dying won't kill them.\nThe Plaguebearer or Pestilence needs to be the last killer alive to win the game.",
    "Soul Collector": "The Soul Collector is a Neutral role with its own win condition.\nTheir goal is to collect a certain number of souls to win.",
    "Survivor": "The Survivor is a Neutral role which can win by simply surviving.\nHowever, if Lovers, or a Neutral Evil role wins the game, the survivor loses.",
    "The Glitch": "The Glitch is a Neutral role with its own win condition.\nThe Glitch's aim is to kill everyone and be the last person standing.\nThe Glitch can Hack players, resulting in them being unable to report bodies and do tasks.\nHacking prevents the hacked player from doing anything but walk around the map.\nThe Glitch can Mimic someone, which results in them looking exactly like the other person.",
    "Vampire": "The Vampire is a Neutral role with its own win condition.\nThe Vampire can convert or kill other players by biting them.\nIf the bitten player was a Crewmate they will turn into a Vampire (unless there are 2 Vampires alive)\nElse they will kill the bitten player.",
    "Werewolf": "The Werewolf is a Neutral role with its own win condition.\nAlthough the Werewolf has a kill button, they can't use it unless they are Rampaged.\nOnce the Werewolf rampages they gain Impostor vision and the ability to kill.\nHowever, unlike most killers their kill cooldown is really short.\nThe Werewolf needs to be the last killer alive to win the game."
  }
}